controllers/SiteController.php

    public function actionIndex()
    {
        $posts = Posts::find()->all();
---
SELECT * FROM `posts`

    public function actionCreate(){
        $post = new Posts();
        $formData = Yii::$app->request->post();
        if ($post->load($formData)){
            if($post->save()){
---
INSERT INTO `posts` (`title`, `description`, `category`) VALUES ('1', '2', 'e-commerce')

    public function actionUpdate($id){
        $post = Posts::findOne($id);
        if($post->load(Yii::$app->request->post()) && $post->save()){
---
SELECT * FROM `posts` WHERE `id`='2'
UPDATE `posts` SET `title`='Wordpress', `description`='Lorem ipsum dolor sit amet consectetur, adipisicing elit.\r\n', `category`='CMS' WHERE `id`=1

    public function actionDelete($id){
        $post = Posts::findOne($id)->delete();
---
DELETE FROM `posts` WHERE `id`=4
SELECT * FROM `posts` WHERE `id`='4'